In [1]:
import pandas as pd

In [2]:
purchases_data = {
    'purchase_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'date': [
        '2023-08-01T00:00:00.000Z', '2023-08-05T00:00:00.000Z', 
        '2023-08-10T00:00:00.000Z', '2023-08-15T00:00:00.000Z', 
        '2023-08-20T00:00:00.000Z', '2023-08-25T00:00:00.000Z', 
        '2023-09-01T00:00:00.000Z', '2023-09-05T00:00:00.000Z', 
        '2023-09-10T00:00:00.000Z', '2023-09-15T00:00:00.000Z'
    ],
    'amount': [299, 149, 89, 199, 79, 349, 129, 249, 99, 179],
    'product_id': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'customer_id': [1, 1, 2, 1, 3, 2, 5, 5, 999, 998]
}

registered_customers_data = {
    'customer_id': [1, 2, 3, 4, 5, 6, 7],
    'customer_name': [
        'John Smith', 'Maria Garcia', 'David Johnson', 
        'Sarah Wilson', 'Michael Brown', 'Emma Davis', 'James Miller'
    ],
    'join_date': [
        '2023-01-15T00:00:00.000Z', '2023-02-20T00:00:00.000Z', 
        '2023-03-10T00:00:00.000Z', '2023-04-05T00:00:00.000Z', 
        '2023-05-12T00:00:00.000Z', '2023-06-18T00:00:00.000Z', 
        '2023-07-22T00:00:00.000Z'
    ],
    'state': [
        'California', 'Texas', 'New York', 'Florida', 
        'Illinois', 'Washington', 'Oregon'
    ],
    'country': ['USA', 'USA', 'USA', 'USA', 'USA', 'USA', 'USA']
}

purchases_df = pd.DataFrame(purchases_data)
customers_df = pd.DataFrame(registered_customers_data)

In [3]:
purchases_df.head()

   purchase_id                      date  amount  product_id  customer_id
0            1  2023-08-01T00:00:00.000Z     299         101            1
1            2  2023-08-05T00:00:00.000Z     149         102            1
2            3  2023-08-10T00:00:00.000Z      89         103            2
3            4  2023-08-15T00:00:00.000Z     199         104            1
4            5  2023-08-20T00:00:00.000Z      79         105            3

In [4]:
customers_df.head()

   customer_id  customer_name                 join_date       state country
0            1     John Smith  2023-01-15T00:00:00.000Z  California     USA
1            2   Maria Garcia  2023-02-20T00:00:00.000Z       Texas     USA
2            3  David Johnson  2023-03-10T00:00:00.000Z    New York     USA
3            4   Sarah Wilson  2023-04-05T00:00:00.000Z     Florida     USA
4            5  Michael Brown  2023-05-12T00:00:00.000Z    Illinois     USA

In [13]:
merge_df = customers_df.merge(purchases_df, how='left', on='customer_id')
merge_df

,customer_id,customer_name,join_date,state,country,purchase_id,date,amount,product_id
0,1,John Smith,2023-01-15T00:00:00.000Z,California,USA,1.0,2023-08-01T00:00:00.000Z,299.0,101.0
1,1,John Smith,2023-01-15T00:00:00.000Z,California,USA,2.0,2023-08-05T00:00:00.000Z,149.0,102.0
2,1,John Smith,2023-01-15T00:00:00.000Z,California,USA,4.0,2023-08-15T00:00:00.000Z,199.0,104.0
3,2,Maria Garcia,2023-02-20T00:00:00.000Z,Texas,USA,3.0,2023-08-10T00:00:00.000Z,89.0,103.0
4,2,Maria Garcia,2023-02-20T00:00:00.000Z,Texas,USA,6.0,2023-08-25T00:00:00.000Z,349.0,106.0
5,3,David Johnson,2023-03-10T00:00:00.000Z,New York,USA,5.0,2023-08-20T00:00:00.000Z,79.0,105.0
6,4,Sarah Wilson,2023-04-05T00:00:00.000Z,Florida,USA,NaN,NaN,NaN,NaN
7,5,Michael Brown,2023-05-12T00:00:00.000Z,Illinois,USA,7.0,2023-09-01T00:00:00.000Z,129.0,107.0
8,5,Michael Brown,2023-05-12T00:00:00.000Z,Illinois,USA,8.0,2023-09-05T00:00:00.000Z,249.0,108.0
9,6,Emma Davis,2023-06-18T00:00:00.000Z,Washington,USA,NaN,NaN,NaN,NaN
10,7,James Miller,2023-07-22T00:00:00.000Z,Oregon,USA,NaN,NaN,NaN,NaN

In [14]:
need_df = merge_df[['customer_id', 'purchase_id']]
need_df

    customer_id  purchase_id
0             1          1.0
1             1          2.0
2             1          4.0
3             2          3.0
4             2          6.0
5             3          5.0
6             4          NaN
7             5          7.0
8             5          8.0
9             6          NaN
10            7          NaN

In [17]:
result = need_df.groupby('customer_id')['purchase_id'].count().reset_index(name='total_orders')
result

   customer_id  total_orders
0            1             3
1            2             2
2            3             1
3            4             0
4            5             2
5            6             0
6            7             0